{
    "request_id": 1,
    "recommendations": {
        "courses": [
            {
                "marketing_url": "https://www.edx.org/learn/risk-management/indiana-university-planning-for-risk-and-retirement",
                "title": "Planning for Risk and Retirement",
                "partner": [
                    "Indiana University"
                ],
                "primary_description": "Learn to assess your tolerance for risk, evaluate investment products, and develop an investment mindset. This course prepares you to compare insurance policies, calculate your need for retirement income, and includes a step-by-step workshop on retirement planning.",
                "secondary_description": "Through course videos, selected short readings, and self-paced activities, students in this course will gain both conceptual and practical knowledge of the inevitable and universal decisions around managing risk, planning for retirement, and starting a program of investment. You’ll develop your ability to:\n\nClassify a variety of financial risks\nChoose between risk acceptance and risk avoidance\nAssess your family’s need for life insurance including the amount and type\nChoose between whole, term, and universal life products\nUnderstand the features and limitations of property and casualty insurance products\nCompare policy features and costs across insurance products\nUnderstand an insurance policy and how to save money when purchasing\nDetermine your need for renter’s insurance\nDistinguish between basic automobile insurance and coverages\nAssess your need for comprehensive and collision insurance\nParticipate in a step-by-step workshop on retirement planning\nCalculate your retirement income needs and identify common sources of retirement income\nDistinguish between investment and speculation\nUnderstand and compare the features of secured credit\nAssess your tolerance for risk in investments and evaluate investment products\nDevelop your investment mindset\n",
                "tertiary_description": "Planning for Risk, Retirement and Investment is made possible by the Brian and Sheila Jellison Family Foundation.\nThe Planning for Risk, Retirement & Investment course is designed for individuals to build financial literacy, one of the most pressing needs Americans face today. Financial decisions made by individuals impact the larger community in significant ways with pervasive cost due to financial mistakes. A recent study by the Financial Industry Regulatory Authority (FINRA) reveals over 50% of Americans have less than $10,000 saved for retirement. In addition, over 50% of Americans have no emergency fund, unable to cope with an unexpected car repair without borrowing funds. Financial literacy is an urgent need for many.\nThis course dives deeply into issues and decisions that impact your financial future. You’ll explore strategies around controlling and managing risk, planning for retirement, and cultivating an investment mindset. Through a hands-on approach, you’ll gain answers to common personal financial questions including:\n\nWhat exactly is risk, and why should I care about it?\nWhat are the core concepts and principles of insurance?\nHow do insurance companies help consumers manage risk?\nDo I need to buy life insurance and how much?\nWhat are my family’s needs for security from loss of life and property?\nWhat are my options for life insurance?\nWhat are good decisions that both save money and protect me from reasonable risks?\nDo I need full coverage auto insurance, or can I save money with liability insurance?\nHow much money do I need in retirement, and how do I determine my needs?\nWhere can I look for sources of income in retirement?\nAm I ready both financially and philosophically to be an investor?\nWhat are the risks of investing, and am I ready to accept them?\nHow do I allocate my investments depending upon the stage of my life?\n\nThrough course videos, selected short readings, and self-paced activities, students in this course will gain both practical knowledge of core concepts of risk, retirement, and investment, and a broader view of the role of planning plays in our quest for financial and personal satisfaction.",
                "availability": [
                    "Available now"
                ],
                "subject": [
                    "Economics & Finance"
                ],
                "level": [
                    "Introductory"
                ],
                "language": [
                    "English"
                ],
                "product": "Course",
                "program_type": [
                    "Professional Certificate"
                ],
                "staff": [
                    "kenneth-carrow",
                    "todd-roberson"
                ],
                "translation_language": [
                    "Arabic",
                    "English",
                    "Spanish (Latin America)",
                    "Indonesian",
                    "Portuguese (Brazil)"
                ],
                "transcription_language": [
                    "Arabic",
                    "Spanish",
                    "Indonesian",
                    "Portuguese - Brazil"
                ],
                "recent_enrollment_count": 450,
                "weeks_to_complete": 4.0,
                "skill": [
                    "Planning",
                    "Financial Services",
                    "Financial Literacy",
                    "Financial Future",
                    "Investments",
                    "Financial Industry Regulatory Authorities",
                    "Insurance Policies"
                ],
                "score": 0.7432851791381836
            },
            {
                "marketing_url": "https://www.edx.org/learn/financial-analysis/new-york-institute-of-finance-financial-analysis-of-insurance-companies-industry-overview-and-analysis-of-financial-and-regulatory-reporting",
                "title": "Financial Analysis of Insurance Companies – Industry Overview and Analysis of Financial and Regulatory Reporting",
                "partner": [
                    "New York Institute of Finance"
                ],
                "primary_description": "Take a deep dive into the operating practices, accounting methodology, and regulatory environment of the insurance industry.",
                "secondary_description": "\nDescribe major industry trends and challenges\nExplain the insurance industry's regulatory environment\nDescribe the operating cycle of an insurance company\nCompare and contrast statutory and U.S. GAAP/IFRS accounting\nDescribe the impairment tests for invested assets\nDifferentiate between loss reserves, policy reserves, UPR and IBNR reserves\n",
                "tertiary_description": "Want to gain a solid understanding of the unique analysis methods needed to assess the financial strength and operating performance of insurance companies in the US and Europe? \nWe’ll begin this course with a look at the main lines of business and the current operating environment of the Life and Health sector of the industry. We will also discuss the impact of changes in interest rates on investment earnings and sales of annuity products. Next, we’ll turn our attention to the property and casualty sector and its main lines of business. We will then look at the trends in premium and investment income for this sector. Next, we’ll look at other sources of financial data and at the different accounting methods and standards that you will encounter when evaluating insurance companies. \nLearners will also be introduced to the rules of SAP and how it differs from GAAP and IFRS accounting. We’ll also look at the mandate and organization of the U.S insurance regulators and the information that insurance companies are required to report each period in order to document their ongoing solvency. Next, we’ll examine the operating cycle of a typical insurance company starting with issuing a policy and ending with reporting financial results. We’ll also look at some key terms that you’ll need to understand and important issues that you’ll need to consider in your analysis.\nWe’ll wrap up this course with a deep dive into how investments are categorized according to risk, valued, and carried differently on the books of a Life versus a P&C insurance company. We’ll talk about some of the red flags you should look for in the mix of assets a company invests in and in the behavior of its asset managers (internal and external).\nNote: This course is part of the Financial Analysis of Insurance Companies Professional Certificate. \n*Audit the first module on Life and Health sector for free and upgrade to verified to unlock the remaining modules.",
                "availability": [
                    "Available now"
                ],
                "subject": [
                    "Economics & Finance"
                ],
                "level": [
                    "Advanced"
                ],
                "language": [
                    "English"
                ],
                "product": "Course",
                "program_type": [
                    "Professional Certificate"
                ],
                "staff": [
                    "jack-farmer"
                ],
                "translation_language": [
                    "Arabic",
                    "English",
                    "Spanish (Latin America)",
                    "Indonesian",
                    "Portuguese (Brazil)"
                ],
                "transcription_language": [
                    "Arabic",
                    "French",
                    "Hindi",
                    "Indonesian",
                    "Telugu",
                    "Portuguese - Brazil",
                    "German",
                    "Portuguese",
                    "Spanish",
                    "Turkish",
                    "Swahili"
                ],
                "recent_enrollment_count": 376,
                "weeks_to_complete": 3.0,
                "skill": [
                    "Generally Accepted Accounting Principles",
                    "Solvency",
                    "Accounting Methods",
                    "Financial Analysis",
                    "International Financial Reporting Standards",
                    "Financial Data",
                    "Investments",
                    "Accounting",
                    "Annuities",
                    "Sales",
                    "SAP Applications"
                ],
                "score": 0.7813401222229004
            },
            {
                "marketing_url": "https://www.edx.org/learn/actuarial-science/the-university-of-wisconsin-madison-actuarial-science-financial-math-for-actuaries-part-1",
                "title": "Financial Math for Actuaries: From Rates to Annuities",
                "partner": [
                    "The University of Wisconsin-Madison"
                ],
                "primary_description": "Start your actuarial career! Study the time-value of money through learning about interest rates, the present and accumulated values of future payments, and the annuity valuation process. This actuarial science course covers foundational concepts tested on SOA Exam FM or CAS Exam 2. This course is part 1 of a 2-course program intended to help students prepare for the SOA Exam FM and CAS Exam 2.",
                "secondary_description": "Those enrolled in Financial Math for Actuaries: From Rates to Annuities will learn:\n\nTo calculate the present value or accumulated value of payments using rates of interest, rates of discount and the force of interest.\nTo calculate the present value or accumulated value for sequences of non-contingent payments (annuities).\nTo reflect payment timing, longevity, and arithmetic/geometric payment changes in the annuity valuation process.\n",
                "tertiary_description": "In preparation for SOA Exam FM / CAS Exam 2, the Financial Math for Actuaries: From Rates to Annuities course will give you opportunities to better understand the time value of money through these learning activities:\n\nPerform calculations relating to the present value, current value, and accumulated value of cash flows, using rates of interest, rates of discount and the force of interest.\nCalculate the present value, current value, and accumulated value for sequences of non-contingent payments (annuities).\nReflect payment timing, longevity, and arithmetic/geometric payment changes in the annuity valuation process.\n",
                "availability": [
                    "Available now"
                ],
                "subject": [
                    "Economics & Finance",
                    "Math"
                ],
                "level": [
                    "Intermediate"
                ],
                "language": [
                    "English"
                ],
                "product": "Course",
                "program_type": [
                    "Professional Certificate"
                ],
                "staff": [
                    "gordon-enderle-6"
                ],
                "translation_language": [
                    "Arabic",
                    "English",
                    "Spanish (Latin America)",
                    "Indonesian",
                    "Portuguese (Brazil)"
                ],
                "transcription_language": [
                    "Arabic",
                    "Spanish",
                    "Indonesian"
                ],
                "recent_enrollment_count": 421,
                "weeks_to_complete": 6.0,
                "skill": [
                    "Time Value Of Money",
                    "Cash Flows",
                    "Mathematical Finance",
                    "Actuarial Exams",
                    "Annuities",
                    "Actuarial Science"
                ],
                "score": 0.7869714498519897
            }
        ],
        "certifications": [
            {
                "marketing_url": "https://www.edx.org/certificates/professional-certificate/wisconsinx-actuarial-science-financial-math-and-probability",
                "title": "Actuarial Science: Financial Math and Probability",
                "partner": [
                    "The University of Wisconsin-Madison"
                ],
                "primary_description": "This certificate program consists of four courses that cover the financial math and probability concepts you need to begin a career as an actuary.",
                "secondary_description": "This certificate program consists of four courses that cover the financial math and probability concepts you need to begin a career as an actuary.\nThe program includes two financial math courses that cover material tested on Exam FM of the Society of Actuaries. In these courses, you will learn to project forward and discount back cash flows from loans, bonds or other financial instruments. Applications in actuarial science are emphasized.\nThe program also includes two probability courses that cover material tested on Exam P of the Society of Actuaries. In these courses, you will study general probability and random variables (both univariate and multivariate) and learn how these concepts apply to actuarial science jobs.\nBy completing this certificate program, you will have the topical background necessary to sit for SOA exam P and SOA exam FM. The threshold for passing these exams can be high, and additional self-study may be necessary to gain the speed and accuracy needed to pass the exams.\nThose who complete this certificate and hold a bachelor’s degree are eligible to expand their actuarial education by applying for preferred admission to UW–Madison’s Actuarial Science Capstone Certificate Program.",
                "tertiary_description": "How to perform calculations relating to the present value, current value, and accumulated value of cash flows, using rates of interest, rates of discount and the force of interest.,How to calculate the price of bonds with various features, develop loan and bond amortization tables, and perform calculations related to loan payments, balances, and refinancing.,General probability concepts including discrete and continuous random variables, expectations, variance, and distributions.,How to perform calculations concerning individual, joint, marginal, and conditional probability functions.,How to apply probability concepts to the valuation of insurance contracts.",
                "availability": [
                    "Available now"
                ],
                "subject": [
                    "Economics & Finance",
                    "Math"
                ],
                "level": [
                    "Intermediate"
                ],
                "language": [
                    "English"
                ],
                "product": "Program",
                "program_type": [
                    "Professional Certificate"
                ],
                "staff": [
                    "gordon-enderle-6"
                ],
                "translation_language": [],
                "transcription_language": [],
                "recent_enrollment_count": 839,
                "weeks_to_complete": "",
                "skill": [
                    "Cash Flows",
                    "Mathematical Finance",
                    "Random Variables",
                    "Actuarial Exams",
                    "Financial Instrument",
                    "Loans",
                    "Probability",
                    "Actuarial Science"
                ],
                "score": 0.6986192464828491
            },
            {
                "marketing_url": "https://www.edx.org/certificates/professional-certificate/babsonx-financial-decision-making-for-leaders",
                "title": "Financial Decision-Making for Leaders",
                "partner": [
                    "Babson College"
                ],
                "primary_description": "Learn financial and quantitative analysis for tackling complex problems that require confident and managerial decision-making.",
                "secondary_description": "Literacy in business financials, regardless of your industry, is essential for growing your career in management. Whether you are working within an organization or have your own business, the decisions you make affect the health of the business. You must interpret and forecast the impact of your decisions to ensure you are making the best recommendation for the firm. Through the four pillars of financial decision-making: Accounting, Finance, Data Analysis and Economics, you can become a successful entrepreneur or intrapreneur. \nThis program will cover these four pillars in-depth - with each course devoted to exploring a particular topic and how it can inform the decisions you face in your career. If you’re looking to discover and practice the fundamental skills and methodology used in business today, this Professional Certificate program is for you. Some of the topics you will cover in this program include: funding, valuation, key performance metrics, financial forecasting, data analysis, and models of consumer choice and demand.  \nThis program is best suited for professionals who are looking to grow their career into a managerial role where they will need to make financial and analytical decisions.  ",
                "tertiary_description": "Practical skills for evaluating and forecasting project ideas and decisions from various perspectives,An essential toolkit for analyzing and utilizing financial statements,How to use data analysis to inform managerial decisions,Economic principles that guide your understanding of the market and the relationship between price and quantity",
                "availability": [
                    "Available now"
                ],
                "subject": [
                    "Business & Management",
                    "Economics & Finance",
                    "Data Analysis & Statistics"
                ],
                "level": [
                    "Introductory"
                ],
                "language": [
                    "English"
                ],
                "product": "Program",
                "program_type": [
                    "Professional Certificate"
                ],
                "staff": [
                    "peter-wilson",
                    "mark-potter",
                    "rick-cleary",
                    "nathan-karst",
                    "davit-khachatryan",
                    "george-recck",
                    "babak-zafari",
                    "john-korsak"
                ],
                "translation_language": [],
                "transcription_language": [],
                "recent_enrollment_count": 5061,
                "weeks_to_complete": "",
                "skill": [
                    "Finance",
                    "Performance Metric",
                    "Financial Forecasting",
                    "Economics",
                    "Accounting",
                    "Data Analysis",
                    "Decision Making",
                    "Entrepreneurship",
                    "Management"
                ],
                "score": 0.7998403310775757
            },
            {
                "marketing_url": "https://www.edx.org/certificates/professional-certificate/babsonx-fundamentals-of-financial-analysis",
                "title": "Fundamentals of Financial Analysis",
                "partner": [
                    "Babson College"
                ],
                "primary_description": "Learn the foundational accounting and finance skills needed to drive sound business decisions.",
                "secondary_description": "Making decisions based on financial data is essential to the success of any company. This accounting and finance Professional Certificate, brought to you by Babson College, the #1 school in Entrepreneurship (U.S. News & World Report), will give learners the foundational accounting and finance skills needed to make critical business decisions.\nWhether you’re an entrepreneur, in management, or looking to become a financial analyst, this program will help you make informed decisions by teaching you financial fundamentals: terms, metrics, and the pillars of primary financial statements: income statement, balance sheet, and cash flow.\nYou'll learn how to interpret and use the information contained in financial statements to make key operating decisions, evaluate a company’s performance, and create forecasts of profits and cash flow. You will learn how to use ratios to diagnose a company's financial health and apply these concepts and tools to valuation, liquidity and other factors for sound decision-making.",
                "tertiary_description": "How primary financial statements are constructed and what types of information are captured in each statement.,How to calculate key performance ratios and use those metrics to evaluate the performance of your business.,How to create a financial forecast that you can use to better manage your business and to present to potential investors and creditors.,Apply data analysis to managerial decisions, especially in start-ups.",
                "availability": [
                    "Available now"
                ],
                "subject": [
                    "Business & Management",
                    "Economics & Finance"
                ],
                "level": [
                    "Introductory"
                ],
                "language": [
                    "English"
                ],
                "product": "Program",
                "program_type": [
                    "Professional Certificate"
                ],
                "staff": [
                    "peter-wilson",
                    "mark-potter"
                ],
                "translation_language": [],
                "transcription_language": [],
                "recent_enrollment_count": 3269,
                "weeks_to_complete": "",
                "skill": [
                    "Financial Statements",
                    "Financial Analysis",
                    "Finance",
                    "Market Liquidity",
                    "Income Statement",
                    "Financial Data",
                    "Balance Sheet",
                    "Accounting",
                    "Forecasting",
                    "Entrepreneurship",
                    "Management",
                    "Teaching"
                ],
                "score": 0.8541399240493774
            }
        ]
    }
}